#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
; SV_InstanceID            0   x           1   INSTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: 45ffde9c199f7077842845f4889aa338.pdb
; shader hash: 45ffde9c199f7077842845f4889aa338
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
; SV_InstanceID            0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Buffer Definitions:
;
; cbuffer Camera
; {
;
;   struct hostlayout.Camera
;   {
;
;       column_major float4x4 view;                   ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !38)
!1 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/PointRenderer/VxPointRenderer.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 7, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 7, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 35, type: !18, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !21, line: 1, size: 192, align: 32, elements: !22)
!21 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/PointRenderer/CmPointRenderer.hlsli", directory: "")
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !21, line: 3, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "localOffset", scope: !20, file: !21, line: 4, baseType: !25, size: 64, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 7, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 7, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 7, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 29, size: 64, align: 32, elements: !33)
!33 = !{!34, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "vertexID", scope: !32, file: !1, line: 31, baseType: !35, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 7, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "instanceID", scope: !32, file: !1, line: 32, baseType: !35, size: 32, align: 32, offset: 32)
!38 = !{!39, !63, !64, !69, !85}
!39 = !DIGlobalVariable(name: "view", linkageName: "\01?view@Camera@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !43, templateParams: !60)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !42, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!60 = !{!13, !61, !62}
!61 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!62 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!63 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@Camera@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 6, type: !40, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariable(name: "padding", linkageName: "\01?padding@Camera@@3QBV?$vector@M$03@@B", scope: !0, file: !1, line: 7, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1024, align: 32, elements: !67)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!67 = !{!68}
!68 = !DISubrange(count: 8)
!69 = !DIGlobalVariable(name: "instanceDataBuffer", linkageName: "\01?instanceDataBuffer@@3V?$StructuredBuffer@UInstanceData@@@@A", scope: !0, file: !1, line: 27, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceData>", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "element", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceData", file: !1, line: 10, size: 128, align: 32, elements: !74)
!74 = !{!75, !84}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !73, file: !1, line: 12, baseType: !76, size: 96, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 40, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 40, size: 96, align: 32, elements: !78, templateParams: !82)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !77, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !77, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !77, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!82 = !{!13, !83}
!83 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !73, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96)
!85 = !DIGlobalVariable(name: "offset", linkageName: "offset.v.1dim", scope: !0, file: !1, line: 17, type: !86, isLocal: false, isDefinition: true, variable: [12 x float]* @offset.v.1dim)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 384, align: 32, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!88 = !{!89}
!89 = !DISubrange(count: 6)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!93 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CPointRenderer\5CVxPointRenderer.hlsl", !"#include \22CmPointRenderer.hlsli\22\0D\0A\0D\0Acbuffer Camera : register(b0)\0D\0A{\0D\0A    float4x4 view;\0D\0A    float4x4 projection;\0D\0A    float4 padding[8];\0D\0A};\0D\0A\0D\0Astruct InstanceData\0D\0A{\0D\0A    float3 position;\0D\0A    float radius;\0D\0A};\0D\0A\0D\0A// Define triangle offsets for a point sprite in NDC space\0D\0Astatic const float2 offset[6] = {\0D\0A    float2(-1.0, -1.0),\0D\0A    float2(-1.0, 1.0),\0D\0A    float2(1.0, -1.0),\0D\0A    float2(1.0, -1.0),\0D\0A    float2(-1.0, 1.0),\0D\0A    float2(1.0, 1.0)\0D\0A};\0D\0A\0D\0A// Input structured buffer of instance data\0D\0AStructuredBuffer<InstanceData> instanceDataBuffer : register(t0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    uint vertexID : SV_VertexID;\0D\0A    uint instanceID : SV_InstanceID;\0D\0A};\0D\0A\0D\0APSInput main(VSInput input)\0D\0A{\0D\0A    PSInput result;\0D\0A\0D\0A    // Get the instance data for the current instance\0D\0A    InstanceData instance = instanceDataBuffer[input.instanceID];\0D\0A\0D\0A    // Compute the world position of the point instance\0D\0A    float4 worldPos = float4(instance.position, 1.0);\0D\0A\0D\0A    // Transform to view space\0D\0A    float4 viewPos = mul(worldPos, view);\0D\0A\0D\0A    // Transform to clip space\0D\0A    float4 clipPos = mul(viewPos, projection);\0D\0A\0D\0A    // Add per-vertex offset to create a quad (point sprite)\0D\0A    float2 localOffset = offset[input.vertexID];\0D\0A\09float perspectiveRadius = instance.radius / clipPos.w;\0D\0A    clipPos.xy += localOffset * perspectiveRadius; // Scale by radius and perspective\0D\0A\0D\0A    // Output final position and local offset\0D\0A    result.position = clipPos;\0D\0A    result.localOffset = localOffset;\0D\0A\0D\0A    return result;\0D\0A}\0D\0A"}
!94 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CPointRenderer\5CCmPointRenderer.hlsli", !"struct PSInput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float2 localOffset : TEXCOORD0;\0D\0A};"}
!95 = !{!"C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/PointRenderer/VxPointRenderer.hlsl"}
!96 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Zi", !"-flegacy-resource-reservation", !"-Qembed_debug"}
!97 = !{i32 1, i32 0}
!98 = !{i32 1, i32 6}
!99 = !{!"vs", i32 6, i32 0}
!100 = !{!101, null, !104, null}
!101 = !{!102}
!102 = !{i32 0, %"class.StructuredBuffer<InstanceData>"* undef, !"instanceDataBuffer", i32 0, i32 0, i32 1, i32 12, i32 0, !103}
!103 = !{i32 1, i32 16}
!104 = !{!105}
!105 = !{i32 0, %hostlayout.Camera* undef, !"Camera", i32 0, i32 0, i32 1, i32 256, null}
!106 = !{i32 0, %"class.StructuredBuffer<InstanceData>" undef, !107, %struct.InstanceData undef, !109, %hostlayout.Camera undef, !112}
!107 = !{i32 16, !108}
!108 = !{i32 6, !"h", i32 3, i32 0}
!109 = !{i32 16, !110, !111}
!110 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!111 = !{i32 6, !"radius", i32 3, i32 12, i32 7, i32 9}
!112 = !{i32 256, !113, !115, !116}
!113 = !{i32 6, !"view", i32 2, !114, i32 3, i32 0, i32 7, i32 9}
!114 = !{i32 4, i32 4, i32 2}
!115 = !{i32 6, !"projection", i32 2, !114, i32 3, i32 64, i32 7, i32 9}
