#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; NORMAL                   0   xyzw        1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: d35637280a82cb4ae0f83e4845deee7f.pdb
; shader hash: d35637280a82cb4ae0f83e4845deee7f
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24)
!1 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/PxStaticModel.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 6, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 6, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !{!25}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !26, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{!15, !28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !29, line: 1, size: 320, align: 32, elements: !30)
!29 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/CmStaticModel.hlsli", directory: "")
!30 = !{!31, !32, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !28, file: !29, line: 3, baseType: !15, size: 128, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !28, file: !29, line: 4, baseType: !15, size: 128, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !28, file: !29, line: 5, baseType: !34, size: 64, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!12, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!44 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CPxStaticModel.hlsl", !"#include \22CmStaticModel.hlsli\22\0D\0A\0D\0Afloat4 main(PSInput input) : SV_TARGET\0D\0A{\0D\0A    // Hard-coded directional light and colors\0D\0A    float3 lightDirection = normalize(float3(0.0f, -1.0f, -1.0f));\0D\0A    float3 lightColor     = float3(1.0f, 1.0f, 1.0f);\0D\0A    float3 ambientColor   = float3(0.2f, 0.2f, 0.2f);\0D\0A\0D\0A    // Normalize the normal coming from the vertex shader\0D\0A    float3 N = normalize(input.normal.xyz);\0D\0A\0D\0A    // Compute the Lambertian diffuse factor\0D\0A    float diffuse = saturate(dot(N, lightDirection));\0D\0A\0D\0A    // Combine ambient and diffuse contributions\0D\0A    float3 color = ambientColor + (diffuse * lightColor);\0D\0A\0D\0A    // Return final color with alpha = 1.0\0D\0A    return float4(color, 1.0f);\0D\0A}"}
!45 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CCmStaticModel.hlsli", !"struct PSInput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float4 normal : NORMAL;\0D\0A    float2 uv : TEXCOORD;\0D\0A};"}
!46 = !{!"C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/PxStaticModel.hlsl"}
!47 = !{!"-E", !"main", !"-T", !"ps_6_0", !"/Zi", !"-flegacy-resource-reservation", !"-Qembed_debug"}
!48 = !{i32 1, i32 0}
!49 = !{i32 1, i32 6}
!50 = !{!"ps", i32 6, i32 0}
!51 = !{i32 0, %struct.PSInput undef, !52}
!52 = !{i32 40, !53, !54, !55}
!53 = !{i32 6, !"position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!54 = !{i32 6, !"normal", i32 3, i32 16, i32 4, !"NORMAL", i32 7, i32 9}
!55 = !{i32 6, !"uv", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!56 = !{i32 1, void ()* @main, !57}
!57 = !{!58}
!58 = !{i32 0, !2, !2}
!59 = !{[12 x i32] [i32 10, i32 4, i32 0, i32 0, i32 0, i32 0, i32 7, i32 7, i32 7, i32 0, i32 0, i32 0]}
!60 = !{void ()* @main, !"main", !61, null, null}
!61 = !{!62, !68, null}
!62 = !{!63, !65, !67}
!63 = !{i32 0, !"SV_Position", i8 9, i8 3, !64, i8 4, i32 1, i8 4, i32 0, i8 0, null}
!64 = !{i32 0}
!65 = !{i32 1, !"NORMAL", i8 9, i8 0, !64, i8 2, i32 1, i8 4, i32 1, i8 0, !66}
!66 = !{i32 3, i32 7}
!67 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !64, i8 2, i32 1, i8 2, i32 2, i8 0, null}
!68 = !{!69}
!69 = !{i32 0, !"SV_Target", i8 9, i8 16, !64, i8 0, i32 1, i8 4, i32 0, i8 0, !70}
!70 = !{i32 3, i32 15}
!71 = !DILocation(line: 3, column: 21, scope: !25)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !25, file: !1, line: 3, type: !28)
!73 = !DIExpression(DW_OP_bit_piece, 128, 32)
!74 = !DIExpression(DW_OP_bit_piece, 160, 32)
!75 = !DIExpression(DW_OP_bit_piece, 192, 32)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lightDirection", scope: !25, file: !1, line: 6, type: !4)
!77 = !DIExpression()
!78 = !DILocation(line: 6, column: 12, scope: !25)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lightColor", scope: !25, file: !1, line: 7, type: !4)
!80 = !DILocation(line: 7, column: 12, scope: !25)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ambientColor", scope: !25, file: !1, line: 8, type: !4)
!82 = !DILocation(line: 8, column: 12, scope: !25)
!83 = !DILocation(line: 11, column: 16, scope: !25)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !25, file: !1, line: 11, type: !4)
!85 = !DIExpression(DW_OP_bit_piece, 0, 32)
!86 = !DILocation(line: 11, column: 12, scope: !25)
!87 = !DIExpression(DW_OP_bit_piece, 32, 32)
!88 = !DIExpression(DW_OP_bit_piece, 64, 32)
!89 = !DILocation(line: 14, column: 30, scope: !25)
