#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyzw
; NORMAL                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; SV_InstanceID            0   x           3   INSTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: 8928dc46186b9ac0d5f3b4cdcbf66492.pdb
; shader hash: 8928dc46186b9ac0d5f3b4cdcbf66492
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
; SV_InstanceID            0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !35)
!1 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/StaticModel/VxStaticModel.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 7, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 7, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 18, type: !18, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !4, !4, !26, !33}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !21, line: 1, size: 320, align: 32, elements: !22)
!21 = !DIFile(filename: "C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/StaticModel/CmStaticModel.hlsli", directory: "")
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !21, line: 3, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !21, line: 4, baseType: !4, size: 128, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !21, line: 5, baseType: !26, size: 64, align: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 7, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 7, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 7, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 7, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !{!36, !60, !61, !66}
!36 = !DIGlobalVariable(name: "view", linkageName: "\01?view@Camera@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !40, templateParams: !57)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !39, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!57 = !{!13, !58, !59}
!58 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!59 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!60 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@Camera@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 6, type: !37, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "padding", linkageName: "\01?padding@Camera@@3QBV?$vector@M$03@@B", scope: !0, file: !1, line: 7, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1024, align: 32, elements: !64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!64 = !{!65}
!65 = !DISubrange(count: 8)
!66 = !DIGlobalVariable(name: "instanceDataBuffer", linkageName: "\01?instanceDataBuffer@@3V?$StructuredBuffer@UInstanceData@@@@A", scope: !0, file: !1, line: 15, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceData>", file: !1, line: 15, size: 512, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "element", type: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceData", file: !1, line: 10, size: 512, align: 32, elements: !71)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "modelMatrix", scope: !70, file: !1, line: 12, baseType: !38, size: 512, align: 32)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!76 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CStaticModel\5CVxStaticModel.hlsl", !"#include \22CmStaticModel.hlsli\22\0D\0A\0D\0Acbuffer Camera : register(b0)\0D\0A{\0D\0A\09float4x4 view;\0D\0A    float4x4 projection;\0D\0A\09float4 padding[8];\0D\0A};\0D\0A\0D\0Astruct InstanceData\0D\0A{\0D\0A    float4x4 modelMatrix;\0D\0A};\0D\0A\0D\0AStructuredBuffer<InstanceData> instanceDataBuffer : register(t0);\0D\0A\0D\0A\0D\0APSInput main(float4 position : POSITION, float4 normal : NORMAL, float2 uv : TEXCOORD, uint instanceID : SV_InstanceID)\0D\0A{\0D\0A   \09PSInput result;\0D\0A\0D\0A    // Fetch instance model matrix\0D\0A    float4x4 modelMatrix = instanceDataBuffer[instanceID].modelMatrix;\0D\0A\0D\0A\09// World space\0D\0A    float4 worldPos = mul(position, modelMatrix);\0D\0A    // Camera (view) space\0D\0A    float4 viewPos  = mul(worldPos, view);\0D\0A    // Clip space\0D\0A    float4 clipPos  = mul(viewPos, projection);\0D\0A\0D\0A\09result.position = clipPos;\0D\0A\0D\0A\09// Transform normal (using the 3x3 part of the modelMatrix)\0D\0A    // If non-uniform scaling is present, use inverse-transpose of modelMatrix\C3\A2\E2\82\AC\E2\84\A2s 3x3 for correct lighting.\0D\0A    float3 worldNormal = mul(modelMatrix, normal);\0D\0A    // Pass it as float4 but only the xyz is relevant for shading\0D\0A    result.normal = float4(worldNormal, 0.0f);\0D\0A\0D\0A    result.uv = uv;\0D\0A\0D\0A    return result;\0D\0A}"}
!77 = !{!"C:\5CUsers\5Conurk\5CDocuments\5CCode\5CProjects\5CPapyrus Engine\5CCaravan\5CShaders\5CStaticModel\5CCmStaticModel.hlsli", !"struct PSInput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float4 normal : NORMAL;\0D\0A    float2 uv : TEXCOORD;\0D\0A};"}
!78 = !{!"C:/Users/onurk/Documents/Code/Projects/Papyrus Engine/Caravan/Shaders/StaticModel/VxStaticModel.hlsl"}
!79 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Zi", !"-flegacy-resource-reservation", !"-Qembed_debug"}
!80 = !{i32 1, i32 0}
!81 = !{i32 1, i32 6}
!82 = !{!"vs", i32 6, i32 0}
!83 = !{!84, null, !87, null}
!84 = !{!85}
!85 = !{i32 0, %"hostlayout.class.StructuredBuffer<InstanceData>"* undef, !"instanceDataBuffer", i32 0, i32 0, i32 1, i32 12, i32 0, !86}
!86 = !{i32 1, i32 64}
!87 = !{!88}
